from enum import Enum
import json

class PayloadEnum(Enum):

    AUTH_PAYLOAD = {
        "query": "mutation ($login: String!, $password: String!, $fingerprint: String!, $forceLogin: Boolean) {\n  authentication {\n    security {\n      login(\n        username: $login\n        password: $password\n        fingerprint: $fingerprint\n        forceLogin: $forceLogin\n      ) {\n        accessToken\n        refreshToken\n      }\n    }\n  }\n}",
        "variables": {
            "login": "DEMOWEB",
            "password": "awdrgy",
            "fingerprint": "b8c57ee2df402530f751a46f8752a6dc",
            "forceLogin": True
        }
    }

    GET_PAYLOAD = {
    "tasks": [
         {
          "objectName": "ЛицевыеСчета",
          "methodName": "вставить",
          "params": {
            "запись": {
              "номер": "9",
              "название": "",
              "адрес": "",
              "адреслс": "",
              "примечание": "",
              "счет-наниматель>фио": "",
              "счет-линейный участок": None,
              "улица-лицевой счет": None,
              "счет-наниматель": "",
              "e-mail": "",
              "адресдоставки": "",
              "индексдоставки": 0,
              "областьдоставки": "",
              "стороннийномер": "",
              "гуид": "",
              "тип": 0,
              "типздания": 0,
              "счета": -10,
              "договор": "",
              "счет-аналитика1": None,
              "электросеть": "",
              "датаоткрытия": "2025-04-01T00:00:00.000",
              "начисления с": None,
              "датазакрытия": None,
              "гис_елс": "",
              "счет-доставка": None,
              "месблок": "",
              "@кадастровый номер": "",
              "@количество подъезды": 0,
              "@количество этажи": 0,
              "@этажей наименьшее": 0,
              "@год постройки": 0,
              "@площадь общая": 0,
              "@застроенная площадь": 0,
              "видпотребления": 0,
              "@наниматели": "",
              "юлфл": "",
              "сетьпуть": "",
              "видблокировкиюл": "",
              "@вадмрежиме": 0,
              "кадастровый номер": "",
              "@управляющая компания": "",
              "$номерЗаписи": -1,
              "$этоПапка": True,
              "$название": "",
              "$папка": -10,
              "$полеПапка": "Счета",
              "$текущаяСтраница": 0,
              "$толькоЧтение": False,
              "$блокировка": 0,
              "$блокирующийПользователь": "",
              "@индексдома": 0,
              "@старыйномер": "0",
              "@счет-структура": "",
              "@цвет": "",
              "адреснаяструктура": "",
              "впадреслс": "",
              "датпарнач": "2025-04-01T00:00:00.000",
              "договорномер": "",
              "жко": "",
              "закрытыймесяц": "2025-03-01T00:00:00.000",
              "код строения": 0,
              "месяц блокировки": "2023-05-01T00:00:00.000",
              "подразделение": 0,
              "подъезд": 0,
              "позициядоговора": 0,
              "райгаз": "",
              "счет-наниматель>полноефио": "",
              "телефон": "",
              "типпомещ": 0,
              "фамилия": "",
              "этаж": 0,
              "$естьИзменения": False
            },
            "блокировать": {
              "url": "https://demo.app.stack-it.ru/fl/accounts?openModal=new",
              "комментарий": "Район"
            },
            "этоПапка": True,
            "тип": 0
          }
        }
      ],
      "info": {
        "workMonth": "2025-05-01T00:00:00.000"
      }
    }

    LIST_PAYLOAD = {
          "tasks": [
            {
              "objectName": "ЛицевыеСчета",
              "methodName": "получить",
              "params": {
                "размерСтраницы": 100,
                "номерСтраницы": 1,
                "фильтр": {}
              }
            }
          ],
          "info": {
            "workMonth": "2025-05-01T00:00:00.000"
          }
        }



class PaloadMethod:

    @staticmethod
    def delete_payload(number_record):

        delete_json = {
            "tasks": [
                {
                    "objectName": "ЛицевыеСчета",
                    "methodName": "удалить",
                    "params": {
                        "номераЗаписей": number_record
                    }
                }
            ],
            "asyncJob": True,
            "info": {
                "workMonth": "2025-05-01T00:00:00.000"
            }
        }
        return delete_json

    @staticmethod
    def updete_payload(number_record, surname):
        updete_json = {
            "tasks": [
                {
                    "objectName": "ЛицевыеСчета",
                    "methodName": "обновить",
                    "params": {
                        "запись": {
                            "тип": 0,
                            "$номерЗаписи": f"{number_record}",
                            "$этоПапка": True,
                            "$папка": -10,
                            "$естьИзменения": True,
                            "номер": "7",
                            "название": "",
                            "адрес": "",
                            "адреслс": "",
                            "примечание": "",
                            "счет-наниматель>фио": "",
                            "счет-линейный участок": None,
                            "улица-лицевой счет": None,
                            "счет-наниматель": "",
                            "e-mail": "",
                            "адресдоставки": "",
                            "индексдоставки": 0,
                            "областьдоставки": "",
                            "стороннийномер": "",
                            "гуид": "",
                            "типздания": 0,
                            "счета": -10,
                            "договор": "",
                            "счет-аналитика1": None,
                            "электросеть": "",
                            "датаоткрытия": "2025-04-01T00:00:00.000",
                            "начисления с": None,
                            "датазакрытия": None,
                            "гис_елс": "",
                            "счет-доставка": None,
                            "месблок": "",
                            "@кадастровый номер": "",
                            "@количество подъезды": 0,
                            "@количество этажи": 0,
                            "@этажей наименьшее": 0,
                            "@год постройки": 0,
                            "@площадь общая": 0,
                            "@застроенная площадь": 0,
                            "видпотребления": 0,
                            "@наниматели": "",
                            "юлфл": "",
                            "сетьпуть": "",
                            "видблокировкиюл": "",
                            "@вадмрежиме": 0,
                            "кадастровый номер": "",
                            "@управляющая компания": "",
                            "$название": "",
                            "$полеПапка": "Счета",
                            "$текущаяСтраница": 0,
                            "$толькоЧтение": False,
                            "$блокировка": 0,
                            "$блокирующийПользователь": "",
                            "@индексдома": 0,
                            "@старыйномер": "0",
                            "@счет-структура": "",
                            "@цвет": "",
                            "адреснаяструктура": "",
                            "впадреслс": "",
                            "датпарнач": "2025-04-01T00:00:00.000",
                            "договорномер": "",
                            "жко": "",
                            "закрытыймесяц": "2025-03-01T00:00:00.000",
                            "код строения": 0,
                            "месяц блокировки": "2023-05-01T00:00:00.000",
                            "подразделение": 0,
                            "подъезд": 0,
                            "позициядоговора": 0,
                            "райгаз": "",
                            "счет-наниматель>полноефио": "",
                            "телефон": "",
                            "типпомещ": 0,
                            "фамилия": f"{surname}",
                            "этаж": 0,
                            "$блок": True
                        },
                        "этоПапка": True,
                        "тип": 0
                    }
                }
            ],
            "info": {
                "workMonth": "2025-05-01T00:00:00.000"
            }
        }
        return updete_json
